{
	"description": "Cada proyecto completado refleja una <1>profunda experiencia técnica</1> y una <2>comprensión de las necesidades específicas del cliente</2>. Desde <3>aplicaciones web modernas</3> hasta <4>arquitecturas de microservicios robustas</4>, pasando por <5>soluciones personalizadas</5>, cada logro demuestra un compromiso con la entrega de resultados de alto rendimiento y sostenibles. Descubra una selección de proyectos que muestran la capacidad de transformar ideas en soluciones concretas e innovadoras.",
	"forClient": "Este proyecto ha sido realizado para el cliente <1>{{client}}</1>.",
	"project1": {
		"title": "Seguimiento de carga del Eurotúnel",
		"description": "En este proyecto, se desarrollaron microservicios innovadores para ampliar las capacidades de seguimiento de los camiones de mercancías que cruzan el Canal de la Mancha.\n Paralelamente, se realizó la modernización técnica de componentes esenciales relacionados con el seguimiento de vehículos.\n Además, se mejoró el sistema de back-office que gestiona la aplicación utilizada por los conductores, integrando nuevas funcionalidades para mejorar su experiencia general.",
		"technologies": [
			"ReactJS",
			".NET Core",
			"Azure",
			"Microservicios",
			"Docker",
			"Kubernetes"
		],
		"imageUrl": "https://images.unsplash.com/photo-1495870043034-74e1a009f631?q=80&w=800&h=200&auto=format&fit=crop",
		"client": "GetLink"
	},
	"project2": {
		"title": "Cdiscount à volonté",
		"description": "En este proyecto, el desarrollo de la oferta 'Cdiscount à volonté' fue una prioridad. Esto implicó la creación de microservicios en Java con Spring y la mejora de la oferta en el sitio web para PC utilizando .NET y C#.\n Además, se realizaron mejoras en la oferta para plataformas móviles y aplicaciones utilizando React JS y React Native, garantizando una experiencia de usuario óptima.",
		"technologies": [
			"ReactJS",
			".NET Core",
			"Azure",
			"Microservicios",
			"Docker",
			"Kubernetes"
		],
		"imageUrl": "https://images.unsplash.com/photo-1557821552-17105176677c?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80",
		"liveUrl": "https://www.cdiscount.com/cdav",
		"client": "Cdiscount"
	},
	"project3": {
		"title": "Detección de imágenes NSFW",
		"description": "Desarrollo de un servicio de detección de imágenes NSFW (Not Safe For Work) basado en IA para un sistema de carga.",
		"technologies": [
			"Pitón",
			"AI",
			"Docker",
			"Microservicios",
			"Kubernetes",
			"GPU"
		],
		"imageUrl": "/projects/nsfw.jpg",
		"client": "Private"
	},
	"ees": {
		"title": "EES (Entry-Exit system)",
		"description": "El Sistema de Entrada/Salida (EES) será un sistema informático automatizado diseñado para registrar a los viajeros de terceros países. Es un proyecto presentado por la Comisión Europea.\nMi misión en este proyecto fue diseñar e implementar la arquitectura general de la solución (una decena de microservicios, dos frontales, en cinco dominios aplicativos).",
		"technologies": [
			".NET Core",
			"React",
			"Microservices",
			"Azure",
			"Docker",
			"Kubernetes"
		],
		"imageUrl": "/projects/ees.webp",
		"liveUrl": "https://travel-europe.europa.eu/ees/what-ees_en",
		"client": "GetLink"
	},
	"boardingpax": {
		"title": "Boarding Pax",
		"description": "Suministro en tiempo real de planos de carga de los vagones de transporte de vehículos a través del Canal de la Mancha, para que el personal pueda validar la colocación de los vehículos. Este plan de carga también facilita la intervención en caso de incidente.",
		"technologies": [
			"React",
			"Microservices",
			"Azure",
			"Docker",
			"Kubernetes",
			".NET Core"
		],
		"imageUrl": "/projects/boardingpax.avif",
		"client": "GetLink"
	},
	"rancher": {
		"title": "Clúster Rancher",
		"description": "El objetivo de este proyecto era crear un clúster de Kubernetes utilizando el software Rancher. El clúster se utilizó luego para implementar microservicios y aplicaciones. Toda la plataforma está monitorizada utilizando el estándar Open Telemetry y OpenObserve (OTLP).",
		"technologies": [
			"Kubernetes",
			"Rancher",
			"Microservices",
			"Docker",
			"k3S",
			"OpenObserve",
			"Longhorn"
		],
		"imageUrl": "/projects/cluster.webp",
		"client": "Tech Magister"
	},
	"3ie-report": {
		"title": "Informe de peritaje",
		"description": "Implementación de una aplicación web para generar informes de peritaje mediante la agregación de datos de múltiples fuentes.\n Uso del catastro francés, IA y otras API para completar y generar el documento Word.",
		"technologies": [
			"React",
			"Microservices",
			"Docker",
			"Kubernetes",
			"IA",
			"API",
			"Word"
		],
		"imageUrl": "/projects/3ie-report.png",
		"client": "3IE",
		"liveUrl": "https://3ie-report.tech-magister.com/"
	}
}
