{
	"description": "Chaque projet réalisé reflète une <1>expertise technique approfondie</1> et une <2>compréhension des besoins spécifiques des clients</2>. Des <3>applications web modernes</3> aux <4>architectures microservices robustes</4>, en passant par des <5>solutions sur mesure</5>, chaque réalisation témoigne d'un engagement à fournir des résultats performants et durables. Découvrez une sélection de projets qui illustrent une capacité à transformer des idées en solutions concrètes et innovantes.",
	"forClient": "Ce projet a été réalisé pour le client <1>{{client}}</1>.",
	"project1": {
		"title": "Eurotunnel Freight Tracking",
		"description": "Sur ce projet, des microservices innovants ont été développés pour étendre les capacités de suivi des camions de marchandises traversant la Manche.\n En parallèle, une modernisation technique de certains composants essentiels liés au suivi des véhicules a été réalisée.\n De plus, le back-office gérant l'application utilisée par les chauffeurs a été amélioré avec de nouvelles fonctionnalités pour optimiser leur expérience globale.",
		"technologies": [
			"React",
			".NET Core",
			"Azure",
			"Microservices",
			"Docker",
			"Kubernetes"
		],
		"imageUrl": "https://images.unsplash.com/photo-1495870043034-74e1a009f631?q=80&w=800&h=200&auto=format&fit=crop",
		"client": "GetLink"
	},
	"project2": {
		"title": "Cdiscount à Volonté",
		"description": "Sur ce projet, le développement de l'offre \"Cdiscount à volonté\" a été une priorité. Cela a impliqué la création de microservices en Java avec Spring et l'enrichissement de l'offre sur le site PC grâce à .NET et C#.\n Parallèlement, des améliorations ont été apportées à l'offre sur les plateformes mobiles et les applications, en utilisant React JS et React Native, pour garantir une expérience utilisateur optimale.",
		"technologies": [
			"React",
			".NET Core",
			"Azure",
			"Microservices",
			"Docker",
			"Kubernetes"
		],
		"imageUrl": "https://images.unsplash.com/photo-1557821552-17105176677c?ixlib=rb-1.2.1&auto=format&fit=crop&w=800&q=80",
		"liveUrl": "https://www.cdiscount.com/cdav",
		"client": "Cdiscount"
	},
	"project3": {
		"title": "Détection d'image NSFW",
		"description": "Développement d'un service de détection d'image NSFW (Not Safe For Work) basé sur l'IA pour un système d'upload.",
		"technologies": [
			"Python",
			"IA",
			"Docker",
			"Microservices",
			"Kubernetes",
			"GPU"
		],
		"imageUrl": "/projects/nsfw.jpg",
		"client": "Privé"
	},
	"ees": {
		"title": "EES (Entry-Exit system)",
		"description": "Le système d’entrée/sortie (EES) sera un système informatique automatisé permettant d’enregistrer les voyageurs en provenance de pays tiers. C’est un projet présenté par la Commission européenne.\nMa mission sur ce projet a été la mis en place l’architecture globale de la solution (une dizaine de micro-services, 2 frontaux, sur 5 domaines applicatifs)",
		"technologies": [
			".NET Core",
			"React",
			"Microservices",
			"Azure",
			"Docker",
			"Kubernetes"
		],
		"imageUrl": "/projects/ees.webp",
		"liveUrl": "https://travel-europe.europa.eu/ees/what-ees_en",
		"client": "GetLink"
	},
	"boardingpax": {
		"title": "Boarding Pax",
		"description": "Mise à disposition en temps réel des plans de chargement des wagons de transport de véhicules transmanche, pour permettre au personnel de valider le placement des véhicules. Ce plan de chargement permet aussi de faciliter les interventions en cas d’incident.",
		"technologies": [
			"React",
			"Microservices",
			"Azure",
			"Docker",
			"Kubernetes",
			".NET Core"
		],
		"imageUrl": "/projects/boardingpax.avif",
		"client": "GetLink"
	},
	"rancher": {
		"title": "Cluster Rancher",
		"description": "L'objectif de ce projet était de créer un cluster Kubernetes en utilisant le logiciel Rancher. Le cluster a ensuite été utilisé pour déployer des microservices et des applications. L'ensemble de la plateforme est surveillé à l'aide du standard Open Telemetry et d'OpenObserve (OTLP).",
		"technologies": [
			"Kubernetes",
			"Rancher",
			"Microservices",
			"Docker",
			"k3S",
			"OpenObserve",
			"Longhorn"
		],
		"imageUrl": "/projects/cluster.webp",
		"client": "Tech Magister"
	}
}
